---
kind: property
id: P:Autodesk.Revit.DB.TextNoteOptions.HorizontalAlignment
source: html/44769291-8262-a630-90c8-36dfbd460152.htm
---
# Autodesk.Revit.DB.TextNoteOptions.HorizontalAlignment Property

Horizontal alignment of the text.

## Syntax (C#)
```csharp
public HorizontalTextAlignment HorizontalAlignment { get; set; }
```

## Remarks
Default is Left alignment.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration